_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
lambda_1 (Lambda)            (None, 160, 320, 3)       0         
_________________________________________________________________
cropping2d_1 (Cropping2D)    (None, 65, 270, 3)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 63, 268, 24)       672       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 31, 134, 24)       0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 31, 134, 24)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 29, 132, 36)       7812      
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 14, 66, 36)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 14, 66, 36)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 12, 64, 48)        15600     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 6, 32, 48)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 6, 32, 48)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 4, 30, 64)         27712     
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 2, 15, 64)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 2, 15, 64)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1920)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 1164)              2236044   
_________________________________________________________________
dropout_5 (Dropout)          (None, 1164)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 100)               116500    
_________________________________________________________________
dropout_6 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 50)                5050      
_________________________________________________________________
dropout_7 (Dropout)          (None, 50)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 51        
=================================================================
Total params: 2,409,441
Trainable params: 2,409,441
Non-trainable params: 0
_________________________________________________________________
